Identifier: com.github.jc0b.pkg.Ice
Description: Gets the latest version of Ice, and creates an installer pkg.
MinimumVersion: "2.3"
ParentRecipe: com.github.jc0b.download.Ice

Input:
  NAME: Ice
  PKGID: com.jordanbaird.Ice

Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/pkg_root"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/%NAME%/Ice.app"
      destination_path: "%RECIPE_CACHE_DIR%/pkg_root/Applications/Ice.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: "admin"
            path: "/Applications/%NAME%.app"
            user: "root"
            mode: "0755"
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "%PKGID%"
        pkgdir: "%RECIPE_CACHE_DIR%"
