Identifier: com.github.jc0b.download.Ice
Description: Gets the latest version of Ice from Github releases, unpacks it, and verifies the signature.
MinimumVersion: "2.3"

Input:
  NAME: Ice

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: jordanbaird/Ice
      asset_regex: Ice.zip

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%-%version%.zip"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%"
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app'
      requirement: identifier "com.jordanbaird.Ice" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = K2ATHQPJDP
      deep_verification: True
      strict_verification: True
