Description: Gets the latest version of Pique, and imports it into Munki.
Identifier: com.github.jc0b.munki.Pique
ParentRecipe: com.github.jc0b.download.Pique
MinimumVersion: "2.7.6"

Input:
  NAME: Pique
  MUNKI_REPO_SUBDIR: "headmin/pique"
  pkginfo:
    catalogs:
      - testing
    description: >
      A macOS Quick Look extension for syntax-highlighted previews of configuration files and scripts.
    display_name: "%NAME%"
    minimum_os_version: "26.0"
    name: "%NAME%"

Process:
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pathname%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"
