Description: Gets the latest version of the Gitlab glab CLI, and creates an installer pkg.
Identifier: com.github.jc0b.pkg.glab
ParentRecipe: com.github.jc0b.download.glab
MinimumVersion: "2.7.6"

Input:
  NAME: glab
  PKGID: com.gitlab.glab-cli

Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: "0755"
        usr/local: "0755"
        usr/local/bin: "0755"
      pkgroot: "%RECIPE_CACHE_DIR%/pkg_root"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/%NAME%-%DOWNLOAD_ARCH%/bin/glab"
      destination_path: "%RECIPE_CACHE_DIR%/pkg_root/usr/local/bin/glab"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: "wheel"
            path: "/usr/local/bin/glab"
            user: "root"
            mode: "0755"
        pkgname: "%NAME%-%ARCH%-%version%"
        version: "%version%"
        id: "%PKGID%"
        options: "purge_ds_store"
        pkgdir: "%RECIPE_CACHE_DIR%"