Description: |
  Gets the latest version of Particulars from particulars.app.
Identifier: com.github.jc0b.munki.Particulars
MinimumVersion: "2.3"
ParentRecipe: com.github.jc0b.download.Particulars

Input:
  NAME: Particulars
  MUNKI_REPO_SUBDIR: fraserhess/particulars
  pkginfo:
    catalogs:
      - testing
    description: |
      Particulars displays system information about your Mac. It shows computer name, model name, serial number, CPU, RAM, graphics card, OS version, current user, uptime, disk space, and network configuration. It can used in 4 modes: on your desktop, in the menu bar, in the Shortcuts app, or at the command line.
    developer: Fraser Hess
    display_name: Particulars
    name: "%NAME%"
    unattended_install: true
    unattended_uninstall: true

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      purge_destination: true

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/Particulars.pkg/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/payload"
      purge_destination: true

  - Processor: PlistReader
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/payload/Applications/Particulars.app/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: "version"
        CFBundleVersion: "build"

  - Processor: MunkiPkginfoMerger
    Arguments:
      additional_pkginfo:
        version: "%version%.%build%"

  - Processor: MunkiInstallsItemsCreator
    Arguments:
      faux_root: "%RECIPE_CACHE_DIR%/payload"
      installs_item_paths:
        - "/Applications/Particulars.app"
      version_comparison_key: "CFBundleVersion"

  - Processor: MunkiPkginfoMerger

  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pathname%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"