Identifier: com.github.jc0b.munki.OldManYellsAt
Description: >
  Downloads old-man-yells-at from Github releases, and imports
  it into a Munki repository.
MinimumVersion: "2.3"
ParentRecipe: com.github.jc0b.pkg.OldManYellsAt

Input:
  ARCH: "x86_64"
  NAME: "old-man-yells-at"
  DISPLAY_NAME: "old-man-yells-at"
  MUNKI_REPO_SUBDIR: "apps/OldManYellsAt"
  pkginfo:
    catalogs:
      - testing
    description: >
      Use this tool to make Abe Simpson yell at stuff!

      This is the perfect toolkit to improve your Slack emoji game.
    developer: Dominik Roos
    display_name: "%DISPLAY_NAME%"
    name: "%NAME%"
    supported_architectures:
      - "%ARCH%"

Process:
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pkg_path%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"