Description: Gets the latest version of old-man-yells-at, and creates an installer pkg.
Identifier: com.github.jc0b.pkg.OldManYellsAt
ParentRecipe: com.github.jc0b.download.OldManYellsAt
MinimumVersion: "2.3"

Input:
  NAME: old-man-yells-at
  PKGID: com.oncilla.old-man-yells-at

Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: "0755"
        usr/local: "0755"
        usr/local/bin: "0755"
      pkgroot: "%RECIPE_CACHE_DIR%/pkg_root"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/%NAME%-%ARCH%/%NAME%"
      destination_path: "%RECIPE_CACHE_DIR%/pkg_root/usr/local/bin/%NAME%"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: "wheel"
            path: "/usr/local/bin/%NAME%"
            user: "root"
            mode: "0755"
        pkgname: "%NAME%-%ARCH%-%version%"
        version: "%version%"
        id: "%PKGID%"
        options: "purge_ds_store"
        pkgdir: "%RECIPE_CACHE_DIR%"