Description: Downloads the latest VS code zip, based on an architecture you provide.
Identifier: com.github.jc0b.download.VisualStudioCode
MinimumVersion: "2.3"
Input:
  NAME: VisualStudioCode
  DOWNLOAD_ARCH: "" # leave blank for x86, needs to be "-arm64" for Apple Silicon. Can also be "-universal"
  DOWNLOAD_URL: "https://code.visualstudio.com/sha/download?build=stable&os=darwin%DOWNLOAD_ARCH%"

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%"
      filename: "%NAME%.zip"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%%DOWNLOAD_ARCH%"
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/%NAME%%DOWNLOAD_ARCH%/Visual Studio Code.app"
      requirement: identifier "com.microsoft.VSCode" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/%NAME%%DOWNLOAD_ARCH%/Visual Studio Code.app/Contents/Info.plist"
      plist_version_key: "CFBundleShortVersionString"