Description: Downloads the latest VS Code and imports it into Munki.
Identifier: com.github.jc0b.munki.VisualStudioCode
ParentRecipe: com.github.jc0b.download.VisualStudioCode
MinimumVersion: "2.7.6"
Input:
  ARCH: "arm64" # Intel = "x86_64", Apple Silicon = "arm64, Universal = "universal" || Delete the supported_architectures array if using "universal"
  NAME: VisualStudioCode
  DISPLAY_NAME: "VS Code"
  EXTRACT_ICON: "true" # Pass an empty variable to skip icon extraction.
  MUNKI_CATEGORY: Development
  MUNKI_REPO_SUBDIR: "microsoft/visualstudiocode"
  pkginfo:
    catalogs:
      - testing
    category: "%MUNKI_CATEGORY%"
    description: >
      Free and built on open source. Integrated Git, debugging and extensions.
    developer: Microsoft Corporation
    display_name: "%DISPLAY_NAME%"
    name: "%NAME%"
    supported_architectures:
      - "%ARCH%"
    unattended_install: true
    unattended_uninstall: true

Process:
  - Processor: MunkiImporter
    Arguments:
      extract_icon: "%EXTRACT_ICON%"
      pkg_path: "%pathname%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"
