Description: Downloads the latest VS Code zip, and imports it into Munki.
Identifier: com.github.jc0b.munki.VisualStudioCode
ParentRecipe: com.github.jc0b.download.VisualStudioCode
MinimumVersion: "2.3"
Input:
  NAME: VisualStudioCode
  DISPLAY_NAME: "VS Code"
  DOWNLOAD_ARCH: "-x64" # needs to be "-arm64" for Apple Silicon. Can also be "-universal"
  MUNKI_ARCH: "x86_64" # override to arm64 for Apple Silicon. Delete supported_architectures for universal
  MUNKI_REPO_SUBDIR: "microsoft/visualstudiocode"
  pkginfo:
    catalogs:
      - testing
    description: >
      Free and built on open source. Integrated Git, debugging and extensions.
    developer: Microsoft Corporation
    display_name: "%DISPLAY_NAME%"
    name: "%NAME%"
    supported_architectures:
      - "%MUNKI_ARCH%"

Process:

  - Processor: MunkiImporter
    Arguments:
      extract_icon: true
      pkg_path: "%pathname%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"